In [2]:
# import libraries
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [3]:
hostname = 'localhost'
username = 'root'
password = 'Enter_your_password_here'
dbname = 'mysql_python'

In [ ]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect( 
              host = host_name,
              user = user_name,
              password = user_password,
              auth_plugin = 'mysql_native_password')
        print('MySQL Server connection successful')
    except Error as err:
        print(f"Error: '{err}'")
    return connection

# Put our MySQL Terminal password

pw = input('Type your User Password: ')

connection = create_server_connection('localhost', 'root', pw)

In [13]:
# Create mysql_python

def create_database( connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")

create_database_query = "Create database mysql_python"

create_database( connection, create_database_query )

Database created successfully

In [5]:
# Connect to Database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect( 
              host = host_name,
              user = user_name,
              database = db_name,
              password = user_password,
              auth_plugin = 'mysql_native_password')
        print('MySQL Database connection successfull')
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [6]:
# Execute SQL Queries

def execute_query( connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as err:
        print(f"Error: '{err}'")

In [7]:
create_orders_table = """
create table orders
    (
     order_id int primary key auto_increment,
     customer_name varchar(30) not null,
     product_name varchar(20) not null,
     date_ordered date,
     quantity int,
     unit_price float,
     phone_number varchar(20)
     );
"""

alter_table_orders = """
alter table orders
    auto_increment = 101;"""

In [9]:
# connect to the database
connection = create_db_connection( hostname, username, password, dbname)

MySQL Database connection successfull

In [ ]:
execute_query( connection, create_orders_table)

In [40]:
#execute_query( connection, 'drop table orders')

Query executed successfully

In [43]:
execute_query( connection, alter_table_orders)

Query executed successfully

In [13]:
# Insert data

data_orders = """
Insert into orders ( customer_name , product_name, date_ordered, quantity, unit_price, phone_number )
            Values (        'Steve',     'Laptop', '2018-06-12',        2,        800, '6293730802' ),
                   (         'Josh',      'Books', '2019-02-10',       10,         12, '8367489124' ),
                   (        'Stacy',   'Trousers', '2019-12-25',        5,         50, '8976123645' ),
                   (        'Nancy',    'T-shirt', '2018-07-14',        7,         30, '7368145099' ),
                   (        'Maria', 'Headphones', '2019-05-30',        6,         48, '8865316698' ),
                   (        'Danny',   'Smart TV', '2018-08-20',       10,        300, '7720130449' );"""

In [14]:
execute_query( connection, data_orders)

Query executed successfully

In [15]:
def read_query( connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except err:
        print(f"Error: '{err}'")

In [16]:
# Using the select statment
q1 = """
select *
    from orders;"""

In [17]:
results = read_query( connection, q1)
for result in results:
    print(result)

(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Josh', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-shirt', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [20]:
# Using the select statment
q1 = """
select customer_name,
       phone_number
    from orders;"""

results = read_query( connection, q1)
for result in results:
    print(result)

('Steve', '6293730802')
('Josh', '8367489124')
('Stacy', '8976123645')
('Nancy', '7368145099')
('Maria', '8865316698')
('Danny', '7720130449')

In [21]:
# Using the select statment
q1 = """
select customer_name,
       year(date_ordered),
       phone_number
    from orders;"""

results = read_query( connection, q1)
for result in results:
    print(result)

('Steve', 2018, '6293730802')
('Josh', 2019, '8367489124')
('Stacy', 2019, '8976123645')
('Nancy', 2018, '7368145099')
('Maria', 2019, '8865316698')
('Danny', 2018, '7720130449')

In [22]:
# Using the select statment
q1 = """
select *
    from orders;"""

results = read_query( connection, q1)
for result in results:
    print(result)

(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Josh', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-shirt', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [25]:
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
column = ['order_id', 'customer_name', 'product_name', 'date_ordered', 'quantity', 'unit_price', 'phone_number']
df = pd.DataFrame(from_db, columns = column)

display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,800.0,6293730802
1,102,Josh,Books,2019-02-10,10,12.0,8367489124
2,103,Stacy,Trousers,2019-12-25,5,50.0,8976123645
3,104,Nancy,T-shirt,2018-07-14,7,30.0,7368145099
4,105,Maria,Headphones,2019-05-30,6,48.0,8865316698
5,106,Danny,Smart TV,2018-08-20,10,300.0,7720130449